ws_template_dict ={
    "申请ECS服务器":"<p>项目名称:</p>"
               "<p>服务器使用目的:</p>"
               "<p>负责人:</p>"
               "<p>CPU/核:</p>"
               "<p>内存/G:</p>"
               "<p>硬盘/G(服务器自带40G系统盘，默认不创建数据盘):</p>"
               "<p>网络带宽(不需要则填无；需要请填写原因):</p>"
               "<p>数量/台:</p>"
               "<p>购买时长/月:</p>",
    "申请RDS服务器": "<p>项目名称:</p>"
                "<p>服务器使用目的:</p>"
                "<p>负责人:</p>"
                "<p>数据库名:</p>"
                "<p>账户名:</p>"
                "<p>内存/M:</p>"
                "<table class='table table-bordered'>"
                "<thead><tr><th>内存/M</th><th>240</th><th>600</th><th>1200</th><th>2400</th><th>6000</th><th>12000</th><th>24000</th><th>48000</th></tr></thead>"
                "<tbody><tr><td>最大连接数</td><td>60</td><td>150</td><td>300</td><td>600</td><td>1500</td><td>2000</td><td>2000</td><td>2000</td></tr>"
                "<tr><td>最大IOPS</td><td>150</td><td>300</td><td>600</td><td>1200</td><td>3000</td><td>6000</td><td>12000</td><td>14000</td></tr></tbody></table>"
                "<p>硬盘/G:</p>"
                "<p>是否开通外网(不需要则填无；需要请填写原因):</p>"
                "<p>添加白名单服务器:</p>"
                "<p>数量/台:</p>"
                "<p>购买时长/月:</p>",
    "申请SLB负载均衡": "<p>项目名称:</p>"
                 "<p>服务器使用目的:</p>"
                 "<p>网络带宽(不需要则填无；需要请填写原因):</p>"
                 "<p>后端服务器:</p>"
                 "<p>监听协议(tcp监听/http监听/https监听/udp监听):</p>"
                 "<p>TCP监听前端端口号:</p>"
                 "<p>TCP监听后端端口号:</p>"
                 "<p>转发规则(加权轮询/加权最小连接数):</p>"
                 "<p>会话保持是否开启:</p>"
                 "<p>数量/台</p>",
    "ECS配置变更": "<p>服务器ip:</p>"
               "<p>变更CPU/核:</p>"
               "<p>变更内存/G:</p>"
               "<p>变更硬盘/G:</p>"
               "<p>变更网络带宽:</p>"
               "<p>变更原因:</p>",
    "RDS配置变更": "",
    "SLB配置变更": "",
    "反向代理配置": "",
    "SQL执行": "",
    "白名单添加": "",
    "表库迁移": "",
    "数据库创建": "",
    "域名申请": "",
    "域名变更": "",
    "CDN加速": "",
    "新增应用": "",
    "应用下线": "",
    "应用下线": "",
}